INSERT INTO roles (`id`, `role`)
VALUES (1, 'ADMIN'),
       (2, 'USER');

INSERT INTO `want-a-pet`.`addresses` (`id`, `city`, `country_enum`, `street`, `street_number`)
VALUES ('ecf63e3a-198b-4587-aa6a-8f6c6d95e2c9', 'Berlin', 'GERMANY', 'Sparrstr.', '18'),
       ('2c7a03db-0e56-4257-82d5-65e3fbaf429a', 'Sevlievo', 'BULGARIA', 'ul. Ivan Vazov', '15'),
       ('8a0a8a7c-e889-4d9c-8ff9-d9fba8306bd9', 'Sofia', 'BULGARIA', 'kv. Mladost 1', '46');

INSERT INTO `want-a-pet`.`users` (`id`, `created_on`, `email`, `first_name`, `last_name`, `password`, `phone_number`,
                                  `user_type`, `address_id`)
VALUES ('b2bf098b-b1e2-42b7-9e7c-75c0fe9faa74', '2023-09-25', 'admin@email.com', 'Martin', 'Aleksandrov',
        '$2y$10$2zdpup1vdwCFcdguypG/teUOYOr9kWm9LlKJJajRpudlRKLP.PDH.', '0899878524', 'PRIVATE',
        'ecf63e3a-198b-4587-aa6a-8f6c6d95e2c9'),
       ('d543361b-6742-4a65-bbc6-63ec194a5f5e', '2023-10-24', 'user1@email.com', 'Cvetoslav', 'Mitev',
        '$2y$10$2zdpup1vdwCFcdguypG/teUOYOr9kWm9LlKJJajRpudlRKLP.PDH.', '0891378524', 'PRIVATE',
        '2c7a03db-0e56-4257-82d5-65e3fbaf429a'),
       ('f590e77a-8e26-4d78-b688-f5333bd9b576', '2023-11-15', 'user2@email.com', 'Plamen', 'Botev',
        '$2y$10$2zdpup1vdwCFcdguypG/teUOYOr9kWm9LlKJJajRpudlRKLP.PDH.', '0899874754', 'PRIVATE',
        '8a0a8a7c-e889-4d9c-8ff9-d9fba8306bd9');

INSERT INTO users_roles(`user_id`, `role_id`)
VALUES ('b2bf098b-b1e2-42b7-9e7c-75c0fe9faa74', 1),
       ('b2bf098b-b1e2-42b7-9e7c-75c0fe9faa74', 2),
       ('d543361b-6742-4a65-bbc6-63ec194a5f5e', 2),
       ('f590e77a-8e26-4d78-b688-f5333bd9b576', 2);

INSERT INTO `want-a-pet`.`pets` (`id`, `age`, `breed`, `description`, `gender`, `image`, `name`, `type`, `weight`,
                                 `owner_id`)
VALUES ('1', '5', 'Доберман',
        'Доберманът (доберман пинчер) е порода куче, създадена в Тюрингия, Германия в края на XIX век. Оригиналното име на породата е тюрингски пинчер, но след смъртта на своя създател Фридрих Луис Доберман през 1894 година, е заменено на доберман пинчер. След 1949 година е премахната думата пинчер, и се казва Доберман.',
        'MALE',
        'https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/European_Dobermann.jpg/250px-European_Dobermann.jpg',
        'Dobi', 'DOG', 'UP_25KG', 'b2bf098b-b1e2-42b7-9e7c-75c0fe9faa74'),
       ('2', '14', 'Хъски',
        'Сибирското хъски е порода куче, която произлиза от източната част на Сибир. Сибирските хъскита са първоначално селектирани от чукчите в североизточна Азия, по-късно внесени от търговци в Аляска, САЩ и Канада. През 1925 е имало епидемия от дифтерит в Ном в Аляска, и много кучета са били използвани да осигуряват на смени ценните лекарства в покосения от болестта град.',
        'MALE',
        'https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Black-Magic-Big-Boy.jpg/250px-Black-Magic-Big-Boy.jpg',
        'Арес', 'DOG', 'UP_25KG', 'b2bf098b-b1e2-42b7-9e7c-75c0fe9faa74'),
       ('3', '2', 'Немска овчарка',
        'Немското овчарско куче (на немски: Deutscher Schäferhund) е порода големи (по размер) кучета, произхождащи от Германия.[2] Известно още като „Елзаска порода“. Тази порода е сравнително нова – селектирана е през 1899 г.',
        'MALE', 'https://upload.wikimedia.org/wikipedia/commons/4/4f/Berger_allemand_en_montagne.jpg', 'Цезар', 'DOG',
        'UP_25KG', 'd543361b-6742-4a65-bbc6-63ec194a5f5e'),
       ('4', '3', 'Британска късокосместа',
        'Котките от породата Британска късокосместа са едри и могат да се опишат като дебели. Много от контурите им са закръглени като лицето, бузите, ушите, очите и главата. Техният къс широк нос седи над дълбока и силна брадичка и заедно с дълбоките им гърди и късата дебела опашка представят котката като силна и здрава. Козината е къса и гъста, без да е пухкава и се предлага в над 100 комбинации от цветове и шарки на козината.',
        'FEMALE',
        'https://www.purina.bg/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0036_British_shorthair.webp?itok=UToBSCFZ',
        'Jack', 'CAT', 'BETWEEN_0KG_AND_5KG', 'd543361b-6742-4a65-bbc6-63ec194a5f5e'),
       ('5', '5', 'Котки Рагдол',
        'Породата котки Рагдол е голяма, мощна и внушителна с отличителни белези. Котката обаче е изключително спокойна и улегнала, създавайки впечатлението за отпусната парцалена кукла. Широката глава има плосък връх и е широка между ушите. Наситените сини очи са големи. Тялото е дълго и мускулесто с широк гръден кош, къс врат и здрави крака. Лапите са големи кръгли с кичури, а опашката е дълга и пухкава.',
        'FEMALE',
        'https://www.purina.bg/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0013_Ragdoll.webp?itok=5KBg1JXD',
        'Suzi', 'CAT', 'BETWEEN_0KG_AND_5KG', 'f590e77a-8e26-4d78-b688-f5333bd9b576'),
       ('6', '4', 'Норвежка горска котка',
        'Норвежката горска котка е по-голяма от средната котка. Това е елегантна порода с полудългокосместа козина (през лятото е малко по-къса). Тялото е дълго, мускулесто и силно сложено със солидна костна структура. Има дълги крака и пухкава опашка. Главата е дълга и триъгълна с прав профил и високо поставени уши с туфлен връх. Гладка лъскава козина покрива вълнения подкосъм, който е водоотблъскващ.',
        'MALE',
        'https://www.purina.bg/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0019_Norwegian_forest.webp?itok=1lRrHuPC',
        'Nori', 'CAT', 'BETWEEN_0KG_AND_5KG', 'f590e77a-8e26-4d78-b688-f5333bd9b576'),
       ('7', '10', 'Австралийска овчарка',
        'Независимо от името си, това куче не е създадено в Австралия. Негова родина е Северна Америка, където местни фермери решили да кръстосат пиренейски овчарки с различни видове колита – бордърколита, смитфийлдколита и други работни животни от този тип. Получило се е куче с неичерпаема енергия, страст и желание за работа, спокойно и невъзмутимо, което с лекота би се справило с голямо стадо овце или говеда.',
        'MALE', 'https://m.netinfo.bg/media/images/48679/48679724/1250-666-avstralijska-ovcharka.jpg', 'Макс', 'DOG',
        'BETWEEN_11KG_AND_25KG', 'f590e77a-8e26-4d78-b688-f5333bd9b576'),
       ('8', '6', 'Бигъл',
        'Историята на Бигъла започва по времето на британската кралица Елизабет I и крал Хенри VIII. По това време това са едни от най-почитаните и любими кучета в английския кралски двор. Векове наред породата е смятана за чисто британска, докато през 60-те години на 20 век започва разпространението си и по френските земи. А оттам – Бигълът добива широка популярност по целия свят.',
        'FEMALE', 'https://m.netinfo.bg/media/images/49085/49085848/1250-666-bigyl.jpg', 'Sara', 'DOG',
        'BETWEEN_11KG_AND_25KG', 'f590e77a-8e26-4d78-b688-f5333bd9b576'),
       ('9', '5', 'Уелско корги пембрук', 'Уелското корги пембрук е стара английска порода, за която се смята, че е пристигнала на Острова през 1107 година заедно с келтските племена. Въпреки малкия си размер и къси крака, това смело кученце е имало работни функции – помагало е векове наред за опазването на стадата от едри животни.
	    Макар често да се бърка с другото подразделение на коргитата – кардиган, смята се, че пембрук са се появили първи, благодарение на кръстоски на Коргита с шпицове. През 1934 година пембрук и кардиган са вписани като отделни породи уелски коргита.',
        'MALE', 'https://m.netinfo.bg/media/images/48887/48887683/1250-666-uelsko-korgi-pembruk.jpg', 'Kori', 'DOG',
        'BETWEEN_6KG_AND_10KG', 'b2bf098b-b1e2-42b7-9e7c-75c0fe9faa74'),
       ('10', '5', 'Басет',
        'Това куче, известно по цял свят от рекламата на компанията за обувки Hush Puppies, е селектирано за лов на дребен дивеч като зайци, катерици или еноти. Интересният си външен вид дължи на френските басети, английския бийгъл и блъдхаунда. Името му се споменава за първи път през 1863 година на изложба в Париж, а породата е регистрирана официално 10 години по-късно.',
        'MALE', 'https://m.netinfo.bg/media/images/48685/48685362/1250-666-baset.jpg', 'Basi', 'DOG',
        'BETWEEN_11KG_AND_25KG', 'd543361b-6742-4a65-bbc6-63ec194a5f5e');
